# git - система управления версиями кода
# git-hub - сайт, который дает хранилище для кода
# также есть gitlab, bitbucket
# репозиторий - папка с проектом с которой может работать git
# ssh-keygen - создание ключа
# git config --global user.name "your name"
# git config --global user.email "your email"
# указание своих данных
# git init - превратить папку в репозиторий и создает скрытую папку .git
# создаете репозиторий на github 
# git remote add origin <ссылка на репозиторий> - добавить ссылку 
# на репозиторий в переменную origin
# git add ./filename - добавляем указанные файлы в индекс / начинает
# отслеживание файлов
# git commit -m "название для версии" - создание версии кода / создать
# сохранение кода
# git push origin имя_ветки - отправить версию кода на github
# git status - проверка состояния
# git log - список коммитов
# git log --oneline
# gir clone <ссылка на репозиторий> - скачать проект с репозитория /
# склонить проект